benchmarks/link_read/10_mb_read__3_latency_tcp.log
10_mb_read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.38-36-g2768c
Starting 1 process

10_mb_read: (groupid=0, jobs=1): err= 0: pid=184260: Mon Feb 17 00:24:07 2025
  read: IOPS=115, BW=463KiB/s (474kB/s)(10.0MiB/22119msec)
    clat (usec): min=7074, max=19089, avg=8609.01, stdev=726.88
     lat (usec): min=7076, max=19094, avg=8611.75, stdev=727.15
    clat percentiles (usec):
     |  1.00th=[ 7570],  5.00th=[ 7898], 10.00th=[ 8029], 20.00th=[ 8160],
     | 30.00th=[ 8291], 40.00th=[ 8455], 50.00th=[ 8455], 60.00th=[ 8586],
     | 70.00th=[ 8717], 80.00th=[ 8848], 90.00th=[ 9241], 95.00th=[ 9634],
     | 99.00th=[11469], 99.50th=[12518], 99.90th=[16188], 99.95th=[17695],
     | 99.99th=[19006]
   bw (  KiB/s): min=  400, max=  480, per=100.00%, avg=463.89, stdev=12.68, samples=44
   iops        : min=  100, max=  120, avg=115.89, stdev= 3.19, samples=44
  lat (msec)   : 10=97.03%, 20=2.97%
  cpu          : usr=0.56%, sys=0.68%, ctx=2752, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2560,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=463KiB/s (474kB/s), 463KiB/s-463KiB/s (474kB/s-474kB/s), io=10.0MiB (10.5MB), run=22119-22119msec