benchmarks/link_read/10_mb_read__5_latency_tcp.log
10_mb_read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.38-36-g2768c
Starting 1 process

10_mb_read: (groupid=0, jobs=1): err= 0: pid=143202: Sun Feb 16 23:42:02 2025
  read: IOPS=77, BW=311KiB/s (318kB/s)(10.0MiB/32927msec)
    clat (usec): min=11358, max=18064, avg=12826.05, stdev=658.81
     lat (usec): min=11360, max=18066, avg=12829.15, stdev=659.05
    clat percentiles (usec):
     |  1.00th=[11600],  5.00th=[11863], 10.00th=[12125], 20.00th=[12387],
     | 30.00th=[12518], 40.00th=[12649], 50.00th=[12780], 60.00th=[12911],
     | 70.00th=[13042], 80.00th=[13304], 90.00th=[13566], 95.00th=[13829],
     | 99.00th=[15008], 99.50th=[15664], 99.90th=[17695], 99.95th=[17957],
     | 99.99th=[17957]
   bw (  KiB/s): min=  296, max=  328, per=100.00%, avg=311.09, stdev= 6.83, samples=65
   iops        : min=   74, max=   82, avg=77.71, stdev= 1.70, samples=65
  lat (msec)   : 20=100.00%
  cpu          : usr=0.39%, sys=0.56%, ctx=2824, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2560,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=311KiB/s (318kB/s), 311KiB/s-311KiB/s (318kB/s-318kB/s), io=10.0MiB (10.5MB), run=32927-32927msec