benchmarks/link_read/10_mb_read__5_loss_tcp.log
10_mb_read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.38-36-g2768c
Starting 1 process

10_mb_read: (groupid=0, jobs=1): err= 0: pid=149125: Sun Feb 16 23:54:21 2025
  read: IOPS=152, BW=611KiB/s (626kB/s)(10.0MiB/16760msec)
    clat (usec): min=592, max=706010, avg=6525.81, stdev=33705.15
     lat (usec): min=593, max=706011, avg=6527.50, stdev=33705.11
    clat percentiles (usec):
     |  1.00th=[   709],  5.00th=[   840], 10.00th=[   963], 20.00th=[  1205],
     | 30.00th=[  1418], 40.00th=[  1582], 50.00th=[  1729], 60.00th=[  1926],
     | 70.00th=[  2212], 80.00th=[  2966], 90.00th=[  8717], 95.00th=[ 11994],
     | 99.00th=[217056], 99.50th=[261096], 99.90th=[509608], 99.95th=[650118],
     | 99.99th=[708838]
   bw (  KiB/s): min=   32, max= 1416, per=100.00%, avg=618.06, stdev=357.76, samples=33
   iops        : min=    8, max=  354, avg=154.48, stdev=89.45, samples=33
  lat (usec)   : 750=2.23%, 1000=9.45%
  lat (msec)   : 2=51.33%, 4=20.51%, 10=8.55%, 20=6.41%, 50=0.20%
  lat (msec)   : 250=0.55%, 500=0.66%, 750=0.12%
  cpu          : usr=0.36%, sys=0.82%, ctx=2799, majf=0, minf=18
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2560,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=611KiB/s (626kB/s), 611KiB/s-611KiB/s (626kB/s-626kB/s), io=10.0MiB (10.5MB), run=16760-16760msec