benchmarks/link_read/10_mb_read__6_latency_quic.log
10_mb_read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.38-36-g2768c
Starting 1 process

10_mb_read: (groupid=0, jobs=1): err= 0: pid=200270: Mon Feb 17 00:29:32 2025
  read: IOPS=60, BW=240KiB/s (246kB/s)(10.0MiB/42619msec)
    clat (usec): min=14204, max=25770, avg=16608.12, stdev=1003.51
     lat (usec): min=14206, max=25773, avg=16611.39, stdev=1003.95
    clat percentiles (usec):
     |  1.00th=[15008],  5.00th=[15401], 10.00th=[15664], 20.00th=[15926],
     | 30.00th=[16057], 40.00th=[16319], 50.00th=[16581], 60.00th=[16712],
     | 70.00th=[16909], 80.00th=[17171], 90.00th=[17433], 95.00th=[17957],
     | 99.00th=[19792], 99.50th=[23200], 99.90th=[25297], 99.95th=[25560],
     | 99.99th=[25822]
   bw (  KiB/s): min=  208, max=  248, per=99.89%, avg=240.40, stdev= 5.46, samples=85
   iops        : min=   52, max=   62, avg=59.98, stdev= 1.41, samples=85
  lat (msec)   : 20=99.06%, 50=0.94%
  cpu          : usr=0.38%, sys=0.43%, ctx=2884, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2560,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=240KiB/s (246kB/s), 240KiB/s-240KiB/s (246kB/s-246kB/s), io=10.0MiB (10.5MB), run=42619-42619msec