benchmarks/link_read/10_mb_read__6_latency_tcp.log
10_mb_read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.38-36-g2768c
Starting 1 process

10_mb_read: (groupid=0, jobs=1): err= 0: pid=203021: Mon Feb 17 00:30:24 2025
  read: IOPS=67, BW=269KiB/s (276kB/s)(10.0MiB/38057msec)
    clat (usec): min=13198, max=20936, avg=14829.44, stdev=660.82
     lat (usec): min=13201, max=20944, avg=14832.55, stdev=661.42
    clat percentiles (usec):
     |  1.00th=[13566],  5.00th=[13960], 10.00th=[14091], 20.00th=[14353],
     | 30.00th=[14484], 40.00th=[14615], 50.00th=[14746], 60.00th=[14877],
     | 70.00th=[15008], 80.00th=[15270], 90.00th=[15533], 95.00th=[15795],
     | 99.00th=[16909], 99.50th=[17695], 99.90th=[19530], 99.95th=[20579],
     | 99.99th=[20841]
   bw (  KiB/s): min=  255, max=  280, per=99.97%, avg=269.21, stdev= 5.39, samples=75
   iops        : min=   63, max=   70, avg=67.19, stdev= 1.41, samples=75
  lat (msec)   : 20=99.92%, 50=0.08%
  cpu          : usr=0.33%, sys=0.49%, ctx=2745, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2560,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=269KiB/s (276kB/s), 269KiB/s-269KiB/s (276kB/s-276kB/s), io=10.0MiB (10.5MB), run=38057-38057msec