benchmarks/link_read/10_mb_read__7_latency_quic.log
10_mb_read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.38-36-g2768c
Starting 1 process

10_mb_read: (groupid=0, jobs=1): err= 0: pid=208351: Mon Feb 17 00:32:22 2025
  read: IOPS=54, BW=220KiB/s (225kB/s)(10.0MiB/46634msec)
    clat (usec): min=16288, max=27422, avg=18179.32, stdev=1022.16
     lat (usec): min=16290, max=27426, avg=18182.42, stdev=1022.36
    clat percentiles (usec):
     |  1.00th=[16712],  5.00th=[17171], 10.00th=[17171], 20.00th=[17433],
     | 30.00th=[17695], 40.00th=[17957], 50.00th=[17957], 60.00th=[18220],
     | 70.00th=[18482], 80.00th=[18744], 90.00th=[19006], 95.00th=[19530],
     | 99.00th=[21890], 99.50th=[25822], 99.90th=[26870], 99.95th=[26870],
     | 99.99th=[27395]
   bw (  KiB/s): min=  192, max=  224, per=99.73%, avg=219.67, stdev= 5.86, samples=93
   iops        : min=   48, max=   56, avg=54.83, stdev= 1.50, samples=93
  lat (msec)   : 20=96.68%, 50=3.32%
  cpu          : usr=0.20%, sys=0.45%, ctx=2816, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2560,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=220KiB/s (225kB/s), 220KiB/s-220KiB/s (225kB/s-225kB/s), io=10.0MiB (10.5MB), run=46634-46634msec