benchmarks/link_read/10_mb_read__8_latency_quic.log
10_mb_read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.38-36-g2768c
Starting 1 process

10_mb_read: (groupid=0, jobs=1): err= 0: pid=210927: Mon Feb 17 00:33:22 2025
  read: IOPS=49, BW=197KiB/s (202kB/s)(10.0MiB/51869msec)
    clat (usec): min=18424, max=31908, avg=20224.20, stdev=1186.55
     lat (usec): min=18426, max=31912, avg=20227.25, stdev=1186.75
    clat percentiles (usec):
     |  1.00th=[19006],  5.00th=[19268], 10.00th=[19268], 20.00th=[19530],
     | 30.00th=[19792], 40.00th=[19792], 50.00th=[20055], 60.00th=[20317],
     | 70.00th=[20579], 80.00th=[20579], 90.00th=[21103], 95.00th=[21627],
     | 99.00th=[24773], 99.50th=[29492], 99.90th=[30540], 99.95th=[30802],
     | 99.99th=[31851]
   bw (  KiB/s): min=  168, max=  208, per=99.79%, avg=197.49, stdev= 5.57, samples=103
   iops        : min=   42, max=   52, avg=49.30, stdev= 1.40, samples=103
  lat (msec)   : 20=47.62%, 50=52.38%
  cpu          : usr=0.25%, sys=0.35%, ctx=2786, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2560,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=197KiB/s (202kB/s), 197KiB/s-197KiB/s (202kB/s-202kB/s), io=10.0MiB (10.5MB), run=51869-51869msec