benchmarks/link_read/10_mb_read_quic.log
10_mb_read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.38-36-g2768c
Starting 1 process

10_mb_read: (groupid=0, jobs=1): err= 0: pid=82791: Sun Feb 16 21:54:38 2025
  read: IOPS=361, BW=1448KiB/s (1482kB/s)(10.0MiB/7074msec)
    clat (usec): min=1023, max=7979, avg=2735.45, stdev=984.51
     lat (usec): min=1024, max=7981, avg=2738.25, stdev=986.67
    clat percentiles (usec):
     |  1.00th=[ 1237],  5.00th=[ 1418], 10.00th=[ 1663], 20.00th=[ 1975],
     | 30.00th=[ 2212], 40.00th=[ 2409], 50.00th=[ 2573], 60.00th=[ 2737],
     | 70.00th=[ 2933], 80.00th=[ 3261], 90.00th=[ 4178], 95.00th=[ 4883],
     | 99.00th=[ 5735], 99.50th=[ 6128], 99.90th=[ 6849], 99.95th=[ 7242],
     | 99.99th=[ 7963]
   bw (  KiB/s): min= 1304, max= 1576, per=100.00%, avg=1448.93, stdev=87.59, samples=14
   iops        : min=  326, max=  394, avg=362.21, stdev=21.89, samples=14
  lat (msec)   : 2=21.13%, 4=66.99%, 10=11.88%
  cpu          : usr=1.51%, sys=1.98%, ctx=2954, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2560,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1448KiB/s (1482kB/s), 1448KiB/s-1448KiB/s (1482kB/s-1482kB/s), io=10.0MiB (10.5MB), run=7074-7074msec