benchmarks/link_read/10_mb_read_tcp.log
10_mb_read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.38-36-g2768c
Starting 1 process
10_mb_read: Laying out IO file (1 file / 10MiB)

10_mb_read: (groupid=0, jobs=1): err= 0: pid=21454: Sun Feb 16 21:39:43 2025
  read: IOPS=713, BW=2852KiB/s (2921kB/s)(10.0MiB/3590msec)
    clat (usec): min=572, max=6515, avg=1384.02, stdev=687.56
     lat (usec): min=573, max=6519, avg=1385.38, stdev=688.33
    clat percentiles (usec):
     |  1.00th=[  676],  5.00th=[  750], 10.00th=[  807], 20.00th=[  898],
     | 30.00th=[  963], 40.00th=[ 1037], 50.00th=[ 1156], 60.00th=[ 1352],
     | 70.00th=[ 1516], 80.00th=[ 1745], 90.00th=[ 2212], 95.00th=[ 2835],
     | 99.00th=[ 3884], 99.50th=[ 4555], 99.90th=[ 6128], 99.95th=[ 6456],
     | 99.99th=[ 6521]
   bw (  KiB/s): min= 2499, max= 3496, per=100.00%, avg=2862.43, stdev=342.66, samples=7
   iops        : min=  624, max=  874, avg=715.43, stdev=85.84, samples=7
  lat (usec)   : 750=4.73%, 1000=30.47%
  lat (msec)   : 2=52.03%, 4=11.84%, 10=0.94%
  cpu          : usr=2.37%, sys=2.48%, ctx=2919, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2560,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=2852KiB/s (2921kB/s), 2852KiB/s-2852KiB/s (2921kB/s-2921kB/s), io=10.0MiB (10.5MB), run=3590-3590msec